package day01;

public class Ex12 {
	public static void main(String[] args) {
		//12. 형변환에 대해 자세히 설명하시오
		
		//형변환에는 기본형 메소드 안에서 이루어지는 자동형변환과 강제형변환이 있으며, 
		//다른 형태와 이루어지는 형변환이 있다.
		
		//자동형변환은 큰 공간에 작은 값을 넣게 될 때, 
		//문자형을 유니코드 정수형으로 변환할 때
		//실수 + 정수 = 실수
		//숫자 + 문자 = 문자열
		//등의 상황에서 자동으로 이루어지게 되며,
		//long a = b; 형태로 이루어진다
		
		//강제형변환은 말 그대로 강제로 형태를 변경시키게 되며, 
		//int c = (int)aL; 형태로 이루어진다.
		
		//다른 형태와 이루어지는 형변환의 경우에는
		//문자열의 경우, Integer.parseInt() 의 형태로 이루어지며,
		//문자형으로 변환하는 경우 "변환할 값".charAt(변환할 값의 인덱스 자리넘버)의 형태로 이루어진다.
	}
}
